# x_path의 각성별 라벨
# '*[@id="selEtcSub_0"]/div[2]/label[{}]'.format()
# //*[@id="selEtcSub_0"]/div[2]/label[86] : 황후의 은총

arousal_dict = {

    '각성' : 2,
    '갈증' : 3,
    '강령술' : 4,
    '강화 무기' : 5,
    '강화 방패' : 6,
   
    '결투의 대가' : 7,
    '고독한 기사' : 8,
    '광기' : 9,
    '광전사의 비기' : 10,
    '구슬동자' : 11,
    '굳은 의지' : 12,
    '극의: 체술' : 13,
    '급소 타격' : 14,
    '기습의 대가' : 15,
    '긴급구조' : 16,
    
    '넘치는 교감' : 17,
    '달의 소리' : 18,
    '달인의 저력' : 19,
    '돌격대장' : 20,
    '두 번째 동료' : 21,
    '마나 효율 증가' : 22,
    '마나의 흐름' : 23,
    '멈출 수 없는 충동' : 24,
    '바리케이드' : 25,
    '버스트' : 26,
   
    '번개의 분노' : 27,
    '부러진 뼈' : 28,
    '분노의 망치' : 29,
    '분쇄의 주먹' : 30,
    '불굴' : 31,
    '사냥의 시간' : 32,
    '상급 소환사' : 33,
    '선수필승' : 34,
    '세맥타통' : 35,
    '속전속결' : 36,
    
    '슈퍼 차지' : 37,
    '승부사' : 38,
    '시선 집중' : 39,
    '실드 관통' : 40,
    '심판자' : 41,
    '아드레날린' : 42,
    '아르데타인의 기술' : 43,
    '안정된 상태' : 44,
    '약자 무시' : 45,
    '에테르 포식자' : 46,
    
    '여신의 가호' : 47,
    '역천지체' : 48,
    '예리한 둔기' : 49,
    '오의 강화' : 50,
    '오의난무' : 51,
    '완벽한 억제' : 52,
    '원한' : 53,
    '위기 모면' : 54,
    '일격필살' : 55,
    '잔재된 기운' : 56,

    '저주받은 인형' : 57,
    '전문의' : 58,
    '전투 태세' : 59,
    '절실한 구원' : 60,
    '절정' : 61,
    '절제' : 62,
    '점화' : 63,
    '정기 흡수' : 64,
    '정밀 단도' : 65,
    '죽음의 습격' : 66,

    '중갑 착용' : 67,
    '중력 수련' : 68,
    '진실된 용맹' : 69,
    '진화의 유산' : 70,
    '질량 증가' : 71,
    '초심' : 72,
    '최대 마나 증가' : 73,
    '추진력' : 74,
    '축복의 오라' : 75,
    '충격 단련' : 76,
    
    '타격의 대가' : 77,
    '탈출의 명수' : 78,
    '포격 강화' : 79,
    '폭발물 전문가' : 80,
    '피스메이커' : 81,
    '핸드거너' : 82,
    '화력 강화' : 83,
    '환류' : 84,
    '황제의 칙령' : 85,
    '황후의 은총'  : 86,

}



# x_path의 특성별 라벨
character_dict = {

    '치명' : 2,
    '특화' : 3,
    '제압' : 4,
    '신속' : 5,
    '인내' : 6,
    '숙련' : 7

}



# x_path의 장신구별 라벨
item_dict = {

    '목걸이' : 11,
    '반지' : 12,
    '팔찌' : 13
    
}